vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp

//========================================================================//
//                                                                        //
//  ## ESP32-ILI9481-LCD-Library ##                                       //
//  ILI9481 320 x 480 LCD driver and graphics library for ESP32 boards    //
//                                                                        //
//  Filename : ESP32_ILI9481.cpp                                          //
//  Author : Vishnu M Aiea                                                //
//  Source : https://github.com/vishnumaiea/ESP32-ILI9481-LCD-Library     //
//  Author's website : www.vishnumaiea.in                                 //
//  Initial release : IST 11:51 PM 07-04-2018, Saturday                   //
//  License : GNU GPL version 3.0                                         //
//  Additional source license/s :                                         //
//    1. BSD license @ Adafruit Industries                                //
//       https://github.com/adafruit/Adafruit-GFX-Library                 //
//                                                                        //
//  File last modified : +05:30 11:26:00 PM, 09-04-2018, Monday           //
//                                                                        //
//========================================================================//

#include "ESP32_ILI9481.h"
#include "XPT2046_Touchscreen.h"

//========================================================================//
//parallel data pins for ILI9481 display (recommended)
//below pins are  for DOIT DevKit board version 1
//pin numbers are of digital pins
//note : pins for ESP32 Devkit and Node32S are different

// #define CS_PIN_LCD  26
// #define RST_PIN_LCD 12
// #define DC_PIN_LCD  14
// #define WR_PIN_LCD  27
//
// #define PD0   15    //DB8  - D15
// #define PD1   2     //DB9  - D2
// #define PD2   0     //DB10 - D0
// #define PD3   4     //DB11 - D4
// #define PD4   16    //DB12 - D16
// #define PD5   17    //DB13 - D17
// #define PD6   21    //DB14 - D21
// #define PD7   22    //DB15 - D22

//========================================================================//
//LCD functions

LCD_ILI9481::LCD_ILI9481 (uint8_t a, uint8_t b, uint8_t c, uint8_t d, uint8_t e, uint8_t f, uint8_t g, uint8_t h,
                          uint8_t i, uint8_t j, uint8_t k, uint8_t l) {
  _PD0 = a;
  _PD1 = b;
  _PD2 = c;
  _PD3 = d;
  _PD4 = e;
  _PD5 = f;
  _PD6 = g;
  _PD7 = h;
  _CS_PIN_LCD = i;
  _RST_PIN_LCD = j;
  _DC_PIN_LCD = k;
  _WR_PIN_LCD = l;
  _bus_width = 8;
}

//------------------------------------------------------------------------//
//initializes the display with proper reset sequence

void LCD_ILI9481::initializeDisplay() {
  //the following statement won't work on the rev 0 of ESP32 chip
  GPIO.out |= (PORT_MASK << _DC_PIN_LCD); //DC high
  GPIO.out |= (PORT_MASK << _CS_PIN_LCD); //CS high
  GPIO.out |= (PORT_MASK << _WR_PIN_LCD); //WR high
  GPIO.out |= (PORT_MASK << _RST_PIN_LCD); //RST high
  delay(100);
  GPIO.out &= (~(PORT_MASK << _DC_PIN_LCD)); //RST low
  delay(100);
  GPIO.out |= (PORT_MASK << _RST_PIN_LCD); //RST high
  delay(100);
  GPIO.out &= (~(PORT_MASK << _CS_PIN_LCD)); //CS low

  startDisplay();
  // Serial.println("LCD Initialized.");
}

//------------------------------------------------------------------------//
//starts the display with required configurations

void LCD_ILI9481::startDisplay() {
  writeCommand(EXIT_SLEEP_MODE); //exit sleep mode
    delay(80);

  writeCommand(POWER_SETTING); //power setting
    writeData8(0x07U);
    writeData8(0x42U);
    writeData8(0x18U);

  writeCommand(VCOM_CONTROL); //VCOM control
    writeData8(0x00U);
    writeData8(0x07U);
    writeData8(0x10U);

  writeCommand(POWER_SETTING_NORMAL); //power setting for normal mode
    writeData8(0x01U);
    writeData8(0x02U); //Fosc setting

  writeCommand(PANEL_DRIVE_SETTING); //panel driving setting - 5 parameters
    writeData8(0x10U); //REV=1, SM=0, GS=0 - grayscale inversion enabled : will invert colors
    //writeData8(0x00); //REV=0, SM=0, GS=0 - no color inversion

    writeData8(0x3BU); //NL[5] - max lines
    writeData8(0x00U); //SCN - scanning start position
    writeData8(0x0U); //PTV=1 (halts vcom)
    writeData8(0x02U); //NDL (non-display area o/p level), PTS[3]

    writeData8(0x1U); //PTG=0 (interval scan), ISC[3]=0001 (3 frames)
    // writeData8(0x11); //PTG=1 (interval scan), ISC[3]=0001 (3 frames)
    // writeData8(0x1F); //PTG=1 (interval scan), ISC[3]=1111 (31 frames)
    // writeData8(0x01); //PTG=0 (normal scan), ISC[3]=0002 (3 frames)

  writeCommand(FRAME_RATE_CONTROL); //frame rate and inversion control - 1 parameter
    //writeData8(0x03); //72FPS (default) - this had backlight flickering
    writeData8(0x00U); //125 FPS (max) - this has no flickering

  writeCommand(FRAME_MEMORY_ACCESS_SETTING); //frame memeory access and interface setting
    writeData8(0x0U); //extra data is ignored
    writeData8(0x0U); //all defaults
    writeData8(0x0U);
    writeData8(0x0U);

  writeCommand(SET_TEAR_OFF); //tearing compensation
    // writeData8(0x0);

  writeCommand(TIMING_SETTING_NORMAL); //display timing for normal mode
    writeData8(0x10U); //BC=0 (frame inversion waveform)
    writeData8(0x10U); //line period is 16 clocks
    writeData8(0x22U); //front and back porch lines = 2

  writeCommand(GAMMA_SETTING); //gamma setting
    writeData8(0x00U);
    writeData8(0x32U);
    writeData8(0x36U);
    writeData8(0x45U);
    writeData8(0x06U);
    writeData8(0x16U);
    writeData8(0x37U);
    writeData8(0x75U);
    writeData8(0x77U);
    writeData8(0x54U);
    writeData8(0x0CU);
    writeData8(0x00U);

  writeCommand(SET_ADDRESS_MODE); //set address mode - 1 parameter
    writeData8(0x0AU); //BGR, horizontal flip

  writeCommand(ENTER_NORMAL_MODE); //eneter normal mode - no param

  writeCommand(SET_PIXEL_FORMAT); //set pixel format - 1 parameter
    writeData8(0x55U); //16-bit per pixel
    // writeData(0x66); //18-bit per pixel

