vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp
  setAddrWindow(0, 0, _width, _height);
  //writeCommand(0x2A); //set column address
    //writeData8(0x00);
    //writeData8(0x00);
    //writeData8(0x01);
    //writeData8(0x3F);

  //writeCommand(0x2B); //set page address
    //writeData8(0x00);
    //writeData8(0x00);
    //writeData8(0x01);
    //writeData8(0xDF);
    delay(120);

  writeCommand(SET_DISPLAY_ON); //set display on
}

//------------------------------------------------------------------------//
//writes 8 bit data

void LCD_ILI9481::writeData (uint8_t inputData) {
  GPIO.out &= (~(PORT_MASK << _CS_PIN_LCD)); //CS low
  GPIO.out |= (PORT_MASK << _RST_PIN_LCD); //RST high
  GPIO.out |= (PORT_MASK << _DC_PIN_LCD); //DC high
  GPIO.out |= (PORT_MASK << _WR_PIN_LCD); //WR high

  writeToPins(inputData);

  // Serial.print("B : ");
  // Serial.println(millis());
}

//------------------------------------------------------------------------//
//writes 8 bit command

void LCD_ILI9481::writeCommand (uint8_t inputCommand) {
  GPIO.out &= (~(PORT_MASK << _CS_PIN_LCD)); //CS low
  GPIO.out |= (PORT_MASK << _RST_PIN_LCD); //RST high
  GPIO.out &= (~(PORT_MASK << _DC_PIN_LCD)); //DC low
  GPIO.out |= (PORT_MASK << _WR_PIN_LCD); //WR high

  writeToPins(inputCommand);

  GPIO.out |= (PORT_MASK << _DC_PIN_LCD); //DC high

  // Serial.print("C : ");
  // Serial.println(millis());
}

//------------------------------------------------------------------------//
//writes 16 bit data to the 8-bit bus

void LCD_ILI9481::writeData16 (uint16_t inputData) {
  GPIO.out |= (PORT_MASK << _DC_PIN_LCD); //DC high
  writeToPins(((inputData >> 8) & 0x00FF));
  writeToPins(inputData & 0x00FF);

  // Serial.print("D : ");
  // Serial.println(millis());
}

//------------------------------------------------------------------------//
//writes 8-bit data to 8-bit bus

void LCD_ILI9481::writeData8 (uint8_t inputData) {
  GPIO.out |= (PORT_MASK << _DC_PIN_LCD); //DC high
  writeToPins(inputData);

  // Serial.print("E : ");
  // Serial.println(millis());
}

//------------------------------------------------------------------------//
//writes 8-bit data to individual pins
//LSB is ANDed with 1, and writes HIGH is the ouput is 1, LOW otherwise
//then the data is shifted right to do this for all 8 bits

void LCD_ILI9481::writeToPins (uint32_t inputData) {
  ((inputData >> 0) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD0)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD0));
  ((inputData >> 1) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD1)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD1));
  ((inputData >> 2) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD2)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD2));
  ((inputData >> 3) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD3)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD3));
  ((inputData >> 4) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD4)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD4));
  ((inputData >> 5) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD5)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD5));
  ((inputData >> 6) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD6)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD6));
  ((inputData >> 7) & 0x01) ? (GPIO.out_w1ts |= ((uint32_t)1 << _PD7)) : (GPIO.out_w1tc |= ((uint32_t)1 << _PD7));

  GPIO.out_w1tc |= (PORT_MASK << _WR_PIN_LCD); //WR low
  // delayMicroseconds(100);
  GPIO.out_w1ts |= (PORT_MASK << _WR_PIN_LCD); //WR high

  // Serial.print("F : ");
  // Serial.println(millis());
}

//------------------------------------------------------------------------//

void LCD_ILI9481::displayOn () {
    writeCommand (SET_DISPLAY_ON); //set display on
}

//------------------------------------------------------------------------//

void LCD_ILI9481::displayOff () {
    writeCommand (SET_DISPLAY_OFF); //set display off
}

//------------------------------------------------------------------------//
//sets the number of pixels (or a rectangular window) data to be written to

void LCD_ILI9481::setAddrWindow (int x0, int y0, int x1, int y1) {
  x1 = (x1 >= _width) ? _width -1 : x1;
  y1 = (y1 >= _height) ? _height -1 : y1;
    writeCommand(SET_COL_ADDRESS); //set col address - 4 param
      writeData16(x0);
      writeData16(x1);

    writeCommand(SET_PAGE_ADDRESS); //set page address - 4 param
      writeData16(y0);
      writeData16(y1);

    writeCommand(WRITE_MEMORY_START); //write memory start
    //writeCommand(WRITE_MEMORY_CONTINUE); //write memory continue
}

//------------------------------------------------------------------------//

void LCD_ILI9481::setRotation (int m) {
  writeCommand (SET_ADDRESS_MODE); //set address mode
  int rotation = m % 4; // can't be higher than 3
  switch (rotation) {
    case 0:
      writeData8(0x0A);
      _width  = Width;
      _height = Height;
      break;
    case 1:
      writeData8(0x28);
      _width  = Height;
      _height = Width;
      break;
    case 2:
      writeData8(0x09);
      _width  = Width;
      _height = Height;
      break;
    case 3:
      writeData8(0x2B);
      _width  = Height;
      _height = Width;
      break;
  }
}

//------------------------------------------------------------------------//

void LCD_ILI9481::invertDisplay (boolean i) {
  writeCommand(i ? ENTER_INVERT_MODE : EXIT_INVERT_MODE);
}

//------------------------------------------------------------------------//

void LCD_ILI9481::openWindow (int x0, int y0, int x1, int y1) {
  setAddrWindow(x0, y0, x0 + x1 - 1, y0 + y1 - 1);
}

//------------------------------------------------------------------------//
//writes a single 16b data to the data lines
void LCD_ILI9481::windowData (uint16_t c) {
    writeData16(c);
}

//------------------------------------------------------------------------//
//writes an array of data to the data lines

void LCD_ILI9481::windowData (uint16_t *c, int len) {
    for (uint32_t i = 0; i < len; i++) {
        writeData16(c[i]);
    }
}

//------------------------------------------------------------------------//
//sets a single pixel to a color

void LCD_ILI9481::drawPixel (int x, int y, uint16_t color) {
  if((x < 0) ||(x >= _width) || (y < 0) || (y >= _height)) return;
  setAddrWindow(x,y,x,y);
  writeData16(color);
}

//------------------------------------------------------------------------//
//fills the entire screen with a color

void LCD_ILI9481::fillScreen (uint16_t color) {
  //fillRectangle(0, 0,  _width, _height, color);
  setAddrWindow(0, 0, _width, _height);
  for(int i=0; i<_height; i++) {
    for(int j=0; j<_width; j++) {
      writeData16(color);
    }
  }
}

//------------------------------------------------------------------------//
//fast drawing of horizontal line

