vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp
void LCD_ILI9481::fillRoundRectangle (int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color) {
  // smarter version
  fillRectangle(x+r, y, w-2*r, h, color);
  // draw four corners
  fillCircleHelper(x+w-r-1, y+r, r, 1, h-2*r-1, color);
  fillCircleHelper(x+r    , y+r, r, 2, h-2*r-1, color);
}

//------------------------------------------------------------------------//
// Draw a triangle

void LCD_ILI9481::drawTriangle (int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {
    drawLine(x0, y0, x1, y1, color);
    drawLine(x1, y1, x2, y2, color);
    drawLine(x2, y2, x0, y0, color);
}

//------------------------------------------------------------------------//
// Fill a triangle

void LCD_ILI9481::fillTriangle (int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {
    int16_t a, b, y, last;

    // Sort coordinates by Y order (y2 >= y1 >= y0)
    if (y0 > y1) {
        _swap_int16_t(y0, y1); _swap_int16_t(x0, x1);
    }
    if (y1 > y2) {
        _swap_int16_t(y2, y1); _swap_int16_t(x2, x1);
    }
    if (y0 > y1) {
        _swap_int16_t(y0, y1); _swap_int16_t(x0, x1);
    }

    if(y0 == y2) { // Handle awkward all-on-same-line case as its own thing
        a = b = x0;
        if(x1 < a)      a = x1;
        else if(x1 > b) b = x1;
        if(x2 < a)      a = x2;
        else if(x2 > b) b = x2;
        drawHorizontalLine(a, y0, b-a+1, color);
        return;
    }

    int16_t
    dx01 = x1 - x0,
    dy01 = y1 - y0,
    dx02 = x2 - x0,
    dy02 = y2 - y0,
    dx12 = x2 - x1,
    dy12 = y2 - y1;
    int32_t
    sa   = 0,
    sb   = 0;

    // For upper part of triangle, find scanline crossings for segments
    // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
    // is included here (and second loop will be skipped, avoiding a /0
    // error there), otherwise scanline y1 is skipped here and handled
    // in the second loop...which also avoids a /0 error here if y0=y1
    // (flat-topped triangle).
    if(y1 == y2) last = y1;   // Include y1 scanline
    else         last = y1-1; // Skip it

    for(y=y0; y<=last; y++) {
        a   = x0 + sa / dy01;
        b   = x0 + sb / dy02;
        sa += dx01;
        sb += dx02;
        /* longhand:
        a = x0 + (x1 - x0) * (y - y0) / (y1 - y0);
        b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
        */
        if(a > b) _swap_int16_t(a,b);
        drawHorizontalLine(a, y, b-a+1, color);
    }

    // For lower part of triangle, find scanline crossings for segments
    // 0-2 and 1-2.  This loop is skipped if y1=y2.
    sa = dx12 * (y - y1);
    sb = dx02 * (y - y0);
    for(; y<=y2; y++) {
        a   = x1 + sa / dy12;
        b   = x0 + sb / dy02;
        sa += dx12;
        sb += dx02;
        /* longhand:
        a = x1 + (x2 - x1) * (y - y1) / (y2 - y1);
        b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
        */
        if(a > b) _swap_int16_t(a,b);
        drawHorizontalLine(a, y, b-a+1, color);
    }
}

//------------------------------------------------------------------------//
//draws a single icon to the display with background

void LCD_ILI9481::drawIcon (fontAwesome* icon, int16_t x, int16_t y, uint16_t color, uint16_t bg) {

  char verticalByte = 0; //for vertical bytes

  //iterate through the _width of the glyph
  for(int i=0; i < (icon->fontArray[0]); i++) { //finds start of each set of vertical bytes
    //get a single set of vertical bytes
    for(int j=0; j < icon->verticalByteCount; j++) {
      verticalByte = icon->fontArray[(j+1) + (i * icon->verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        for(int m=0; m < 8; m++) { //iterates through each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            drawPixel(x+i, y + m + (8*j), color); //if a bit is 1, then draw pixel with color
          }
          else {
            drawPixel(x+i, y + m + (8*j), bg); //draw pixel with bg if otherwise
          }
        }
      }
    }
  }
}

//------------------------------------------------------------------------//
//draws a single icon to the display without background

void LCD_ILI9481::drawIcon (fontAwesome* icon, int16_t x, int16_t y, uint16_t color) {

  char verticalByte = 0; //for vertical bytes

  //iterate through the _width of the glyph
  for(int i=0; i < (icon->fontArray[0]); i++) { //finds start of each set of vertical bytes
    //get a single set of vertical bytes
    for(int j=0; j < icon->verticalByteCount; j++) {
      verticalByte = icon->fontArray[(j+1) + (i * icon->verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        for(int m=0; m < 8; m++) { //iterates through each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            drawPixel(x+i, y + m + (8*j), color); //if a bit is 1, then draw pixel with color
          }
          // else {
          //   drawPixel(x+i, y + m + (8*j), bg); //draw pixel with bg if otherwise
          // }
        }
      }
    }
  }
}

//------------------------------------------------------------------------//
//draws a single char to the display with background

void LCD_ILI9481::drawChar (char letter, int16_t x, int16_t y, uint16_t color, uint16_t bg, fontClass* selectedFont) {

  char verticalByte = 0; //for vertical bytes
  int iterateStep = ((letter - selectedFont->startChar) * selectedFont->charByteLength); //bytes need to be jumped to acquire the starting of the next char

  //iterate through the width of the glyph
  for(int i=0; i < (selectedFont->fontArray[iterateStep]); i++) { //finds start of each set of vertical bytes
    //get a single set of vertical bytes
    for(int j=0; j < selectedFont->verticalByteCount; j++) {
      verticalByte = selectedFont->fontArray[iterateStep + (j+1) + (i * selectedFont->verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        for(int m=0; m < 8; m++) { //iterates though each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            drawPixel(x+i, y + m + (8*j), color); //if a bit is 1, then draw pixel with color
          }
          else {
            drawPixel(x+i, y + m + (8*j), bg); //draw pixel with bg if otherwise
          }
        }
      }
    }
  }
}

//------------------------------------------------------------------------//
//draws a single char to the display without background

void LCD_ILI9481::drawChar (char letter, int16_t x, int16_t y, uint16_t color, fontClass* selectedFont) {

  char verticalByte = 0; //for vertical bytes
  int iterateStep = ((letter - selectedFont->startChar) * selectedFont->charByteLength); //bytes need to be jumped to acquire the starting of the next char

  //iterate through the width of the glyph
  for(int i=0; i < (selectedFont->fontArray[iterateStep]); i++) { //finds start of each set of vertical bytes
    //get a single set of vertical bytes
    for(int j=0; j < selectedFont->verticalByteCount; j++) {
      verticalByte = selectedFont->fontArray[iterateStep + (j+1) + (i * selectedFont->verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        for(int m=0; m < 8; m++) { //iterates though each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            drawPixel(x+i, y + m + (8*j), color); //if a bit is 1, then draw pixel with color
          }
          // else if (bgEnable) {
          //   drawPixel(x+i, y + m + (8*j), bg); //draw pixel with bg if otherwise
          // }
        }
      }
    }
  }
}

//------------------------------------------------------------------------//
//writes a string to the display with background

void LCD_ILI9481::printText (String S, int16_t x, int16_t y, uint16_t color, uint16_t bg, fontClass* selectedFont) {
  char stringBuffer[S.length()+1];
  S.toCharArray(stringBuffer, S.length()+1); //create a char array

  for(int i=0; i < S.length(); i++) {
    if(((stringBuffer[i] < selectedFont->startChar) || (stringBuffer[i] > selectedFont->endChar)) && (stringBuffer[i] != 32)) { //check for char validity
      Serial.print("Illegal character found : ");
      Serial.print((int)stringBuffer[i]);
      Serial.print(" at ");
      Serial.println(i);
      Serial.println("String Length : " + S.length());
      return;
    }
  }

