vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp
  int cumulatedLength = 0;

  for(int i=0; i < S.length(); i++) {
    if(i==0) {
      if(stringBuffer[i] == 32) { //if the char is a space
        cumulatedLength += 10; //width for space char
        // Serial.println("Writing space..");
      }
      else {
        // Serial.print("Writing first char : ");
        // Serial.println(stringBuffer[i]);
        drawChar(stringBuffer[i], x, y, color, bg, selectedFont);
        cumulatedLength += selectedFont->fontArray[((stringBuffer[i] - selectedFont->startChar) * selectedFont->charByteLength)] + 2;
      }
    }
    else {
      if(stringBuffer[i] == 32) { //if the char is a space
        // Serial.println("Writing space..");
        cumulatedLength += 10; //width for space char
      }
      else {
        // Serial.print("Writing char : ");
        // Serial.println(stringBuffer[i]);
        drawChar(stringBuffer[i], (x + cumulatedLength), y, color, bg, selectedFont);
        cumulatedLength += selectedFont->fontArray[((stringBuffer[i] - selectedFont->startChar) * selectedFont->charByteLength)] + 2;
      }
    }
  }
}

//------------------------------------------------------------------------//
//writes a string to the display without background

void LCD_ILI9481::printText (String S, int16_t x, int16_t y, uint16_t color, fontClass* selectedFont) {
  char stringBuffer[S.length()+1];
  S.toCharArray(stringBuffer, S.length()+1); //create a char array

  for(int i=0; i < S.length(); i++) {
    if(((stringBuffer[i] < selectedFont->startChar) || (stringBuffer[i] > selectedFont->endChar)) && (stringBuffer[i] != 32)) { //check for char validity
      Serial.print("Illegal character found : ");
      Serial.print((int)stringBuffer[i]);
      Serial.print(" at ");
      Serial.println(i);
      Serial.println("String Length : " + S.length());
      return;
    }
  }

  int cumulatedLength = 0;

  for(int i=0; i < S.length(); i++) {
    if(i==0) {
      if(stringBuffer[i] == 32) { //if the char is a space
        cumulatedLength += 10; //width for space char
        // Serial.println("Writing space..");
      }
      else {
        // Serial.print("Writing first char : ");
        // Serial.println(stringBuffer[i]);
        drawChar(stringBuffer[i], x, y, color, selectedFont);
        cumulatedLength += selectedFont->fontArray[((stringBuffer[i] - selectedFont->startChar) * selectedFont->charByteLength)] + 2;
      }
    }
    else {
      if(stringBuffer[i] == 32) { //if the char is a space
        // Serial.println("Writing space..");
        cumulatedLength += 10; //width for space char
      }
      else {
        // Serial.print("Writing char : ");
        // Serial.println(stringBuffer[i]);
        drawChar(stringBuffer[i], (x + cumulatedLength), y, color, selectedFont);
        cumulatedLength += selectedFont->fontArray[((stringBuffer[i] - selectedFont->startChar) * selectedFont->charByteLength)] + 2;
      }
    }
  }
}

//========================================================================//

fontAwesome::fontAwesome (const char* a, int w, int h, int c, int v, uint32_t u, String n, LCD_ILI9481* l) {
  fontArray = a;
  fontWidth = w;
  fontHeight = h;
  charByteLength = c;
  verticalByteCount = v;
  unicodeId = u;
  name = n;
  glyphWidth = 0;
  glyphHeight = 0;
  glyphX = 0;
  glyphY = 0;
  lcdParent = l;
}

//------------------------------------------------------------------------//

fontAwesome::fontAwesome (const char* a, int w, int h, int c, int v, uint32_t u, String n) {
  fontArray = a;
  fontWidth = w;
  fontHeight = h;
  charByteLength = c;
  verticalByteCount = v;
  unicodeId = u;
  name = n;
  glyphWidth = 0;
  glyphHeight = 0;
  glyphX = 0;
  glyphY = 0;
  lcdParent = NULL;
}

//------------------------------------------------------------------------//
//gets the width, height and offsets of a icon, char or string in pixels
//an offset is simply how many lines of empty pixels are before a valid black pixel

void fontAwesome::getSize() {
  char verticalByte = 0; //for vertical bytes

  bool areAllBytesZero = true; //whether all bytes in a verticl set are zero
  bool nonZeroByteFound = false; //whether any non-zero bytes found in any vertical set

  int glyphOffsetLeft = 0;
  int glyphOffsetTop = -1; //-1 so that we can have a start condition without conflicting with actual 0 offset value
  int glyphOffsetBottom = 0;
  int glyphOffsetRight = 0;

  //iterate through the width of the glyph
  for(int i=0; i < (fontArray[0]); i++) { //finds start of each set of vertical bytes
    //get a single set of vertical bytes
    for(int j=0; j < verticalByteCount; j++) {
      verticalByte = fontArray[(j+1) + (i * verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        areAllBytesZero = false;
        nonZeroByteFound = true;
        glyphOffsetRight = i; //if there's a non-zero vertical byte in a cloumn, save it. This will eventually find the right-most pixel
        for(int m=0; m < 8; m++) { //iterates through each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            if(glyphOffsetTop < 0) glyphOffsetTop = (j*8)+m; //assign the location of the first pixel found
            else if(glyphOffsetTop > ((j*8)+m)) glyphOffsetTop = (j*8)+m; //now check if any pixel higher than previous found
            if(glyphOffsetBottom < ((j*8)+m)) glyphOffsetBottom = (j*8)+m;
          }
        }
      }
    }

    if(areAllBytesZero && (!nonZeroByteFound)) {
      glyphOffsetLeft++;
    }
    areAllBytesZero = true;
  }

  if(glyphOffsetTop < 0) glyphOffsetTop = 0;

  glyphX = glyphOffsetLeft;
  glyphY = glyphOffsetTop;

  // glyphOffsetRight = fontWidth - (glyphOffsetRight + 1); //find the Right offset from right-most pixel location
  // glyphOffsetBottom = fontHeight - (glyphOffsetBottom + 1);

  glyphWidth = fontWidth - (glyphOffsetLeft + (fontWidth - (glyphOffsetRight + 1)));
  glyphHeight = fontHeight - (glyphOffsetTop + (fontHeight - (glyphOffsetBottom + 1)));
}

