vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp
//========================================================================//

fontClass::fontClass (const char* a, int w, int h, int c, int v, uint32_t s, uint32_t e, int n, LCD_ILI9481* l) {
  fontArray = a;
  fontWidth = w;
  fontHeight = h;
  charByteLength = c;
  verticalByteCount = v;
  startChar = s;
  endChar = e;
  charCount = n;
  lcdParent = l;
}

//------------------------------------------------------------------------//

fontClass::fontClass (const char* a, int w, int h, int c, int v, uint32_t s, uint32_t e, int n) {
  fontArray = a;
  fontWidth = w;
  fontHeight = h;
  charByteLength = c;
  verticalByteCount = v;
  startChar = s;
  endChar = e;
  charCount = n;
  lcdParent = NULL;
}

//------------------------------------------------------------------------//
//gets the width, height and offsets of a icon, char or string in pixels

void fontClass::getSize (char letter) {
  char verticalByte = 0; //for vertical bytes
  int iterateStep = ((letter - startChar) * charByteLength); //bytes need to be jumped to acquire the starting of the next char

  bool areAllBytesZero = true; //whether all bytes in a verticl set are zero
  bool nonZeroByteFound = false; //whether any non-zero bytes found in any vertical set

  int glyphOffsetLeft = 0;
  int glyphOffsetTop = -1; //-1 so that we can have a start condition without conflicting with actual 0 offset value
  int glyphOffsetBottom = 0;
  int glyphOffsetRight = 0;

  //iterate through the width of the glyph
  for(int i=0; i < (fontArray[iterateStep]); i++) { //finds start of each set of vertical bytes

    //get a single set of vertical bytes
    for(int j=0; j < verticalByteCount; j++) {
      verticalByte = fontArray[iterateStep + (j+1) + (i * verticalByteCount)]; //copy the set of vertical bytes
      if(verticalByte != 0) { //don't display if a byte is zero
        areAllBytesZero = false;
        nonZeroByteFound = true; //because there can be empty columns inside a char
        glyphOffsetRight = i; //if there's a non-zero vertical byte in a cloumn, save it. This will eventually find the right-most pixel
        for(int m=0; m < 8; m++) { //iterates through each pixel of a byte
          if((unsigned(verticalByte >> m)) & 0x1) { //check if a bit is 1
            if(glyphOffsetTop < 0) glyphOffsetTop = (j*8)+m; //assign the location of the first pixel found
            else if(glyphOffsetTop > ((j*8)+m)) glyphOffsetTop = (j*8)+m; //now check if any pixel higher than previous found
            if(glyphOffsetBottom < ((j*8)+m)) glyphOffsetBottom = (j*8)+m;
          }
        }
      }
    }

    if(areAllBytesZero && (!nonZeroByteFound)) { //only count the empty columns before any valid pixels
      glyphOffsetLeft++;
    }
    areAllBytesZero = true;
  }

  if(glyphOffsetTop < 0) glyphOffsetTop = 0; //in case if a char has max height, offset will be zero

  glyphX = glyphOffsetLeft; //the relative XY of the min rectangle that encloses the char
  glyphY = glyphOffsetTop;

  glyphOffsetRight = fontWidth - (glyphOffsetRight + 1); //find the Right offset from right-most pixel location
  glyphOffsetBottom = fontHeight - (glyphOffsetBottom + 1);

  glyphWidth = fontWidth - (glyphOffsetLeft + glyphOffsetRight);
  glyphHeight = fontHeight - (glyphOffsetTop + glyphOffsetBottom);
}

//------------------------------------------------------------------------//
//finds the width, height and XY in terms of pixels of a string printed to the display

void fontClass::getSize (String S) {
  char stringBuffer[S.length()+1];
  S.toCharArray(stringBuffer, S.length()+1); //create a char array

  for(int i=0; i < S.length(); i++) {
    if(((stringBuffer[i] < startChar) || (stringBuffer[i] > endChar)) && (stringBuffer[i] != 32)) { //check for char validity
      Serial.print("Illegal character found : ");
      Serial.print((int)stringBuffer[i]);
      Serial.print(" at ");
      Serial.println(i);
      Serial.println("String Length : " + S.length());
      return;
    }
  }

  int cumulatedLength = 0; //this will yield the string width inclusive of space
  int stringX = 0; //relative X and Y of the smallest rectangle that holds string
  int stringY = 0;
  int stringWidth = 0; //width and height of that smallest rectangle
  int stringHeight = 0;

  for(int i=0; i < S.length(); i++) {
    if(i==0) { //for the first char only
      if(stringBuffer[i] == 32) { //if the char is a space
        cumulatedLength += 10; //width for space char
        stringX = 0; //space char is considered for width calculation
      }
      else {
        getSize(stringBuffer[i]); //determine the parameters of a single char
        stringX = glyphX; //save first char's X and Y
        stringY = glyphY;
        stringHeight = glyphHeight;
        cumulatedLength += fontArray[((stringBuffer[i] - startChar) * charByteLength)] + 2;
      }
    }
    else {
      if(stringBuffer[i] == 32) { //if the char is a space
        cumulatedLength += 10; //width for space char
      }
      else {
        getSize(stringBuffer[i]); //determine the parameters of a single char
        if(stringY > glyphY) stringY = glyphY; //we need the smallest of all Ys of all chars
        if(stringHeight < glyphHeight) stringHeight = glyphHeight; //save the largest height from all chars
        cumulatedLength += fontArray[((stringBuffer[i] - startChar) * charByteLength)] + 2;
      }
    }
  }
  glyphX = stringX;
  glyphY = stringY;
  glyphWidth = stringWidth = cumulatedLength - 2; //cumulatedLength will be the effective width of the string
  glyphHeight = stringHeight;
}

//========================================================================//

buttonClass::buttonClass (int a, int b, int c, int d, int e, uint16_t f, uint16_t g, uint16_t h, uint16_t i,
                          String j, fontClass* k, fontAwesome* l, uint16_t m, uint16_t n, uint16_t o, uint16_t p,
                          bool q, bool r, bool s, bool t, bool u, bool v, bool w, bool x, bool y, bool z,
                          LCD_ILI9481* aa, XPT2046_Touchscreen* ab) {
  x = a;
  y = b;
  width = c;
  height = d;
  radius = e;
  borderColor = f;
  borderHoverColor = g;
  fillColor = h;
  fillHoverColor = i;
  label = j;
  labelFont = k;
  icon = l;
  labelColor = m;
  labelHoverColor = n;
  iconColor = o;
  iconHoverColor = p;
  buttonEnabled = q;
  borderEnabled = r;
  fillEnabled = s;
  labelEnabled = t;
  iconEnabled = u;
  buttonHoverEnabled = v;
  borderHoverEnabled = w;
  fillHoverEnabled = x;
  labelHoverEnabled = y;
  iconHoverEnabled = z;
  lcdParent = aa;
  touchParent = ab;
  currentTouchState = false;
  prevTouchState = false;
}

//------------------------------------------------------------------------//

void buttonClass::draw () {
  if(buttonEnabled) {
    if(buttonHoverEnabled && buttonTouched()) {
      if(fillEnabled) {
        if(fillHoverEnabled) lcdParent->fillRoundRectangle(x, y, width, height, radius, fillHoverColor);
        else lcdParent->fillRoundRectangle(x, y, width, height, radius, fillColor);
      }
      if(borderEnabled) {
        if(borderHoverEnabled) lcdParent->drawRoundRectangle(x, y, width, height, radius, borderHoverColor);
        else lcdParent->drawRoundRectangle(x, y, width, height, radius, borderColor);
      }
      if(iconEnabled) {
        icon->getSize();
        if(iconHoverEnabled) lcdParent->drawIcon(icon, x+(int((width - icon->glyphWidth)/2)), y+(int((height - icon->glyphHeight)/2)), iconHoverColor); //no need of bg color
        else lcdParent->drawIcon(icon, x+(int((width - icon->glyphWidth)/2)), y+(int((height - icon->glyphHeight)/2)), iconColor); //no need of bg color
      }
      if(labelEnabled) {
        labelFont->getSize(label);
        if(labelHoverEnabled) lcdParent->printText(label, x+(int((width - labelFont->glyphWidth)/2)), y+(int((height - labelFont->glyphHeight)/2)), labelHoverColor, labelFont); //no need of bg color
        else lcdParent->printText(label, x+(int((width - labelFont->glyphWidth)/2)), y+(int((height - labelFont->glyphHeight)/2)), labelColor, labelFont); //no need of bg color
      }
    }

    else {
      if(fillEnabled) {
        lcdParent->fillRoundRectangle(x, y, width, height, radius, fillColor);
      }
      if(borderEnabled) {
        lcdParent->drawRoundRectangle(x, y, width, height, radius, borderColor);
      }
      if(iconEnabled) {
        icon->getSize();
        lcdParent->drawIcon(icon, x+(int((width - icon->glyphWidth)/2)), y+(int((height - icon->glyphHeight)/2)), iconColor); //no need of bg color
      }
      if(labelEnabled) {
        labelFont->getSize(label);
        lcdParent->printText(label, x+(int((width - labelFont->glyphWidth)/2)), y+(int((height - labelFont->glyphHeight)/2)), labelColor, labelFont); //no need of bg color
      }
    }
  }
}

//------------------------------------------------------------------------//

void buttonClass::show () {
  buttonEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hide () {
  buttonEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::setXY(int a, int b) {
  x = a;
  y = b;
}

//------------------------------------------------------------------------//

