vishnumaiea/ESP32-ILI9481-LCD-Library/ESP32_ILI9481.cpp
void buttonClass::hoverEnable () {
  buttonHoverEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hoverDisable () {
  buttonHoverEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::showBorder () {
  borderEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hideBorder () {
  borderEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::borderHoverDisable () {
  borderHoverEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::borderHoverEnable () {
  borderHoverEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::showFill () {
  fillEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hideFill () {
  fillEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::fillHoverEnable () {
  fillHoverEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::fillHoverDisable () {
  fillHoverEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::showLabel () {
  labelEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hideLabel () {
  labelEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::labelHoverEnable () {
  labelHoverEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::labelHoverDisable () {
  labelHoverEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::showIcon () {
  iconEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::hideIcon () {
  iconEnabled = false;
}

//------------------------------------------------------------------------//

void buttonClass::iconHoverEnable () {
  iconHoverEnabled = true;
}

//------------------------------------------------------------------------//

void buttonClass::iconHoverDisable () {
  iconHoverEnabled = false;
}

//------------------------------------------------------------------------//

bool buttonClass::buttonTouched () {
  if(touchParent->touched()) {
    TS_Point p = touchParent->getPoint();
    if((p.x >= x) && (p.x < (x+width)) && (p.y >= y) && (p.y < (y+height))) {
      currentTouchState = true;
      prevTouchState = true;
      return true;
    }
    else {
      currentTouchState = false;
    }
  }
  return false;
}

//------------------------------------------------------------------------//

bool buttonClass::buttonPressed () {
  if((!buttonTouched()) && (prevTouchState)) {
    prevTouchState = false;
    return true;
  }
  else return false;
}

//========================================================================//
